; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
; Reference Paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;                  Journal of Artificial Intelligence Research 68 (2020): 691-752. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; The Sailing domain models a number of sailing boats 
; whose task is to rescue people in an unbounded area of the ocean. 
; The positions of the boat and people to be rescued are described by their 2D coordinates.
; The model tries to take into account the different speeds that can be obtained in a sailing boat. 
; Going upwind or fully downwind is slower. We assume that wind comes from the north.

(define (domain sailing)
    (:types boat - object person - object)
    (:predicates 
        (saved ?t - person)
    )
    (:functions
        (x ?b - boat)
        (y ?b - boat)
        (d ?t - person)
    )
    ;; Increment the value in the given counter by one
    (:action go_north_east
         :parameters (?b - boat)

         :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
    )
    (:action go_north_west
         :parameters (?b - boat)

         :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
    )
    (:action go_est
         :parameters (?b - boat)

         :effect (and(increase (x ?b) 3))
    )
    (:action go_west
         :parameters (?b - boat)

         :effect (and(decrease (x ?b) 3))
    )
    (:action go_south_west
         :parameters(?b - boat)

         :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
    )
    (:action go_south_east
         :parameters(?b - boat)

         :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
    )
    (:action go_south
         :parameters(?b - boat)

         :effect (and (decrease (y ?b) 2))
    )
    (:action save_person
        :parameters(?b - boat ?t - person)
        :precondition ( and  (>= (+ (x ?b) (y ?b)) (d ?t)) 
                             (>= (- (y ?b) (x ?b)) (d ?t)) 
                             (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25)) 
                             (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
                      )
        :effect (and(saved ?t))
    )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_2_4)

	(:domain sailing)

	(:objects
		b0 b1 - boat
		p0 p1 p2 p3 - person
	)

  (:init
		(= (x b0) 10)
(= (y b0) 0)
(= (x b1) 8)
(= (y b1) 0)

		(= (d p0) 2)
(= (d p1) 1)
(= (d p2) 1)
(= (d p3) 2)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
		)
	)
)

; plan
1. (go_north_west b1)
   changed: (x b1) from 8 to 6.5, (y b1) from 0 to 1.5
   goals met: 0 of 4
2. (go_north_west b1)
   changed: (x b1) from 6.5 to 5, (y b1) from 1.5 to 3
   goals met: 0 of 4
3. (go_north_west b1)
   changed: (x b1) from 5 to 3.5, (y b1) from 3 to 4.5
   goals met: 0 of 4
4. (save_person b1 p1)
   added: (saved p1)
   goals met: 1 of 4
5. (save_person b1 p2)
   added: (saved p2)
   goals met: 2 of 4
6. (go_north_west b1)
   changed: (x b1) from 3.5 to 2, (y b1) from 4.5 to 6
   goals met: 2 of 4
7. (save_person b1 p0)
   added: (saved p0)
   goals met: 3 of 4
8. (save_person b1 p3)
   added: (saved p3)
   goals met: 4 of 4
